{
  "format": "graph-model",
  "generatedBy": "TF2PyTorch converter",
  "convertedBy": "TensorFlow.js Converter v3.15.0",
  "modelTopology": {
    "nodes": [
      {
        "name": "input",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                },
                {
                  "size": "3"
                },
                {
                  "size": "224"
                },
                {
                  "size": "224"
                }
              ]
            }
          }
        }
      },
      {
        "name": "vit_fish_disease_model",
        "op": "PyTorchModel",
        "attr": {
          "model_path": {
            "s": "../vit_fish_disease.pth"
          }
        },
        "input": ["input"]
      },
      {
        "name": "output",
        "op": "Identity",
        "input": ["vit_fish_disease_model"],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      }
    ],
    "library": {},
    "versions": {}
  },
  "weightsManifest": [
    {
      "paths": ["../vit_fish_disease.pth"],
      "weights": []
    }
  ]
} 